{
    "header": {
        "title": "Portfolio",
        "linkedin": "https://www.linkedin.com/in/juniorsergio/?locale=en_US",
        "localization": "Belo Horizonte, MG, Brazil"
    },

    "main": {
        "tabs": {
            "aboutMe": "About Me",
            "frontend": "Front-End",
            "dataScience": "Data Science"
        },
        "about": {
            "title": "About Me",
            "text": "<p>Having a degree in Computer Engineering from CEFET-MG, I’ve worked as a chatbot developer for a large part of my professional career. Being an interdisciplinary field, it allowed me to explore related fields, such as data analysis, UX writing, and product and agile management. However, with time I've come to realize that this is a field with limited possibilities, both for personal and professional development. In the past few months, I've been seeking to understand what it is that I truly enjoy doing and what makes sense for me in the long term.</p><p>Having done my undergraduate thesis in the Data Science field, I've started from this. Although it's something that I like doing and I've developed a few projects in this area, it doesn't excite me as much as being a developer. While doing online courses, I found the company Rocketseat and their classes about web development with ReactJS, which remembered me of the passion that I always had for graphic design. By doing some projects, I've realized the joy that building web applications bring to me, and decided to dedicate my studies to this field. With that, this portfolio was born, with a few projects that I've already developed, both in front-end and Data Science. The goal is not only to draw recruiters' attention but to put into practice all that I've been learning about web development as well.</p>"
        },

        "frontend" : {
            "soon": "Coming soon",
            "opening": "The web pages below were developed from the lessons of the acceleration program <a href='https://www.rocketseat.com.br/ignite'>Ignite</a> by Rocketseat. In order to access the pages, click on any portion of the carousel. The respective <strong>Github repository</strong> link of each page can be found on their <strong>header.</strong>",
            "projects": [
                {
                    "id": "social-media-feed",
                    "stacks": ["react", "typescript", "graphql"],
                    "title": "Social Media Feed",
                    "description": "Web page developed using ReactJS to simulate a social media feed. It's possible to create posts, write comments and react to them. In order to ensure the data persistence, an integration with <a href='https://hygraph.com/'>Hygraph (formerly GraphCMS)</a> was made, so the information created by the users could be recorded and retrieved. The profile created by the user to interact with the application has an expiration time of one day, and it's possible to change its information within this lifetime.",
                    "type": "active"
                },
                {
                    "id": "personal-finance",
                    "stacks": ["react", "typescript"],
                    "title": "Personal Finance",
                    "description": "Personal Finance",
                    "type": "disabled"
                }
            ]
        },

        "dataScience": [
            {
                "id": "tesouro-direto",
                "title": "Time Series Prediction Models for the Interest Rates of Tesouro Direto IPCA Securities",
                "projectLink": "https://github.com/juniorsergio/Prediction-Projects/tree/master/Tesouro%20Direto",
                "subtitle": "Published Paper (PT-BR)",
                "subtitleLink": "http://dx.doi.org/10.21528/CBIC2021-11",
                "text": "Launched by the Brazilian Federal Government at the end of 2002, the Tesouro Direto platform makes it possible for individuals to purchase government securities, characterizing it as a safe fixed-income investment that is more profitable than savings. This work proposed the use of machine learning models, more precisely the MLP, CNN and LSTM neural networks, in order to create models for forecasting the interest rates of four floating-rate Brazilian government securities bonded to the country’s inflation rate (IPCA). To this end, some features of the Brazilian economy that could have a more direct impact on Tesouro Direto rates were analyzed and defined. In the end, it was concluded that CNN has a better overall result, even though it is more sensitive to feature removal. In contrast, the MLP presented almost constant errors, regardless of the variable being removed.",
                "figcaption": "CNN's Prediction for Tesouro Direto IPCA Security due to 2024"
            },
            {
                "id": "credit-risk",
                "title": "Credit Risk Classification Models",
                "projectLink": "https://github.com/juniorsergio/Classification-Projects/tree/master/Credit%20Risk",
                "text": "One of the most important real-live scenarios for Data Science is the prediction of credit risk, whether someone is going to become a defaulter. This project was developed as part of the admission process of a company, meaning the data provided comes from a real company in the sector. My purpose was to create a machine learning model able to predict the defaulters within a scenario that is safe for the company, instead of trying to pursue the perfect model. During the development, two problems with the data had to be dealt with: the class imbalance and a huge amount of missing values for one of the variables. With that in mind, five algorithms based on decision trees were created, and the best for this particular problem was the XGBoost, using a special parameter to compensate for the class imbalance. The result was a precision of 98% for the negative class and a recall of 70% for the positive (defaulter) class.",
                "figcaption": "Confusion Matrix of the XGBoost model"
            },
            {
                "id": "breaking-bad",
                "title": "Data Exploration of Breaking Bad Episodes Rating",
                "projectLink": "https://github.com/juniorsergio/DataExploration/tree/master/Breaking%20Bad%20-%20Rating%20analysis",
                "text": "Breaking Bad is considered to be one of the best TV shows ever made, which raises questions about how this quality level was obtained. One of those questions, and the purpose of this project, is if there could be any relationship between a an episode IMDB rating and its writer. More specifically, the hyphotesis was that since VInce Gilligan is the crator of the series, his episodes would probably have the highest ratings. In order to do that, this <a href=\"https://www.kaggle.com/varpit94/breaking-bad-tv-show-all-seasons-episodes-data\">dataset</a> was used since it hads the two necessary informations: the episode's rating and its writer. The result of the analysis was that the ratings don't appear to have a strong relationship with the episode's writer.",
                "figcaption": "Boxplot of episode ratings per writer"
            }
        ]
    }
}